#include "stm32f10x.h"
#include "def_all.h"

extern	void	perem(void);
extern	void	mat_potok_1 (void);
extern	void	mat_potok_2 (void);
extern	void	mat_potok_3 (void);
extern	void	mat_potok_4 (void);
extern	void	mat_potok_all (void);
extern	int32_t	Re1,Re2,Re5,Im1,Im2,Im5;
extern	uint32_t my_sqrt (int32_t Re,int32_t Im);

int	adc_sample_number=0;	//циклический номер измерения (0...24)
int	adc_sample_now=0;		//текущее значение обрабатываемого канала АЦП
extern	char	adc_ch;

extern	void	out_stm(void);
extern	void	input_stm(void);
extern	uint8_t	izmer[101];
u32	zzz1_m1,zzz1_m2,zzz1_m3,zzz1_m4,zzz1_m5;
int32_t	my_sin1, my_cos1, my_sin2, my_cos2,my_sin5, my_cos5;
int32_t	my_arr[24];

extern	uint16_t buffer [BUF_SIZE];
extern	uint16_t idxIN;
extern	u32	zzz,zzz1,zzz2;
#define    DWT_CYCCNT       *(volatile unsigned long *)0xE0001004
/*промежуточные суммы 1-го потока и итоговые суммы 1-го потока
(за весь период) для sin и cos составляющей */
int32_t	sum1_sin_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum1_cos_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum1_sin_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum1_cos_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum1_sin_g5[8]={0,0,0,0,0,0,0,0};
int32_t	sum1_cos_g5[8]={0,0,0,0,0,0,0,0};
/*промежуточные суммы 2-го потока и итоговые суммы 2-го потока
(за весь период) для sin и cos составляющей */
int32_t	sum2_sin_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum2_cos_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum2_sin_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum2_cos_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum2_sin_g5[8]={0,0,0,0,0,0,0,0};
int32_t	sum2_cos_g5[8]={0,0,0,0,0,0,0,0};
/*промежуточные суммы 3-го потока и итоговые суммы 3-го потока
(за весь период) для sin и cos составляющей */
int32_t	sum3_sin_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum3_cos_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum3_sin_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum3_cos_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum3_sin_g5[8]={0,0,0,0,0,0,0,0};
int32_t	sum3_cos_g5[8]={0,0,0,0,0,0,0,0};
/*промежуточные суммы 4-го потока и итоговые суммы 4-го потока
(за весь период) для sin и cos составляющей */
int32_t	sum4_sin_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum4_cos_g1[8]={0,0,0,0,0,0,0,0};
int32_t	sum4_sin_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum4_cos_g2[8]={0,0,0,0,0,0,0,0};
int32_t	sum4_sin_g5[8]={0,0,0,0,0,0,0,0};
int32_t	sum4_cos_g5[8]={0,0,0,0,0,0,0,0};

//sin константы 1-й гармоники
const int SIN_F1[24] = 
{
	
	 259,  500,  707,  866,  966, 1000,	
	 966,  866,  707,  500,  259, 0,	 
	-259, -500, -707, -866, -966,-1000,
	-966, -866, -707, -500, -259,	0,
/*	
	 2588,  5000,  7071,  8660,  9659, 10000,	
	 9659,  8660,  7071,  5000,  2588, 0,	 
	-2588, -5000, -7071, -8660, -9659,-10000,
	-9659, -8660, -7071, -5000, -2588,	0,	
*/	
};
//cos константы 1-й гармоники
const	int	COS_F1[24] =
{
	
 	 966,  866,  707,  500,  259, 0,
	-259, -500, -707, -866, -966,-1000,
	-966, -866, -707, -500, -259, 0,
	 259,  500,  707,  866,  966, 1000,		
/*	
 	 9659,  8660,  7070,  5000,  2588, 0,
	-2588, -5000, -7070, -8660, -9659,-10000,
	-9659, -8660, -7070, -5000, -2588, 0,
	 2588,  5000,  7070,  8660,  9659, 10000,
*/
};
//sin константы 2-й гармоники
const	int	SIN_F2[24] =
{
	 500,  866,  1000,  866,  500, 0,
	-500, -866, -1000, -866, -500, 0,
	 500,  866,  1000,  866,  500, 0,
	-500, -866, -1000, -866, -500, 0,
};
//cos константы 2-й гармоники
const	int	COS_F2[24] =
{
	 866,  500,  0, -500, -866, -1000,
	-866, -500,  0,  500,  866,  1000,
	 866,  500,  0, -500, -866, -1000,
	-866, -500,  0,  500,  866,  1000,
};
//sin константы 5-й гармоники
const	int	SIN_F5[24] =
 {
	 966,  500, -707, -866,  259,  1000, 
	 259, -866, -707,  500,  966,     0,
	-966, -500,  707,  866, -259, -1000,
	-259,  866,  707, -500, -966,     0,
};
//cos константы 5-й гармоники
const	int	COS_F5[24] =
{
	 259, -866, -707,  500,  966,     0,
	-966, -500,  707,  866, -259, -1000,
	-259,  866,  707, -500, -966,     0,
	 966,  500, -707, -866,  259,  1000,	
};
